content.org
#+hugo_base_dir: .
#+hugo_section: ./post

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
** DONE Building an autodifferentiation library                       :wyrm:
CLOSED: [2018-07-18 Wed 17:38]
:PROPERTIES:
:EXPORT_FILE_NAME: building-an-autodiff-library
:END:
/This blog post originally appeared on [[https://medium.com/@maciejkula/building-an-autodifferentiation-library-9ccf32c7a658][Medium]]/

Popular general-purpose [[https://en.wikipedia.org/wiki/Automatic_differentiation][auto-differentiation]] frameworks like PyTorch or TensorFlow are very capable, and, for the most part, there is little need for writing something more specialized.

Nevertheless, I have recently started writing my own autodiff package. This blog post describes what I’ve learned along the way. Think of this as a poor-man’s version of a [[https://jvns.ca/][Julia Evans]] blog post.

Note that there are many blog posts describing the mechanics of autodifferentiation much better than I could, so I skip the explanations here. Additionally, there are several other [[http://colah.github.io/posts/2015-09-NN-Types-FP/][interesting]] [[https://jeremyrsmith.github.io/scala-math-slides/#23][posts]] [[https://blog.jle.im/entry/practical-dependent-types-in-haskell-1.html][and]] [[https://arxiv.org/abs/1710.06892][articles]] on building type-safe neural networks constructs, so while my library follows very similar patterns (statically-typed graphs and dependent types), I don’t dwell on the type system angle too much.

Finally, In case you’d like to jump straight to the code, the end result is [[https://github.com/maciejkula/wyrm][here]], together with an obligatory neural-network based [[https://github.com/maciejkula/fizzbuzz][FizzBuzz solution]].
*** Motivation
There are a couple of reasons why I wanted to have my own autodiff/backprop framework, rather than use PyTorch or TensorFlow.

- PyTorch and TF are quite slow when fitting models that require little computation per minibatch. In computer vision problems so much computation is done per minibatch that framework overhead is mostly a non-issue. This isn’t true of fitting matrix-factorization-style models, useful in the recommender systems community. Even on a GPU, fitting these models is very slow.
- I want to be able to use my autodiff library to write and distribute models as Python packages with minimal dependencies. Being able to produce a fairly small and spelf-contained binary is an advantage over the rather heavy TF and PyTorch dependencies.
- It was a fun learning experience, and allowed me to understand the inner workings of mature neural network libraries in a little bit more detail.

Motivated by the desire for a lightweight solution that works well for recommender (and possibly NLP) models, I wrote down a list of design constraints.

- I want the framework to naturally support sparse gradients: cases where the vast majority of gradients are zero. This is very common in NLP and recommender models that use large embedding layers. In any given minibatch, only a very small proportion of the embedding layer is used, and the gradients of the remaining entries are zero. Being able to skip the zeros when performing a gradient update is essential in making these models fast.
- I want the framework to have minimal overhead on top of the actual computation. Since I mainly want to fit small, sparse models, overhead is key. In PyTorch, the run time of such models is dominated by the overhead of looping in Python. To avoid this, my library has to forego Python in its fitting loop, and be written entirely in a compiled language to take advantage of compiler optimizations.
- The models graphs have to be define-by-run, much like Chainer or PyTorch. The usability and debuggability of this approach is too valuable for me to even contemplate going back to the TensorFlow way of doing things. At the same time, I’m happy for the graph to be static once defined. This helps in keeping the overhead small: I can allocate intermediate computation buffers once and keep re-using them, instead of writing a complex buffer pool system (or, worse yet, repeatedly allocating and freeing memory on every pass).
- I want performance to scale approximately linearly with the number of available CPU cores. This means parallelizing at the level of the entire graph rather than individual operations. Each computation thread will have its own copy of the graph, but write to shared parameter buffers on update. This is effectively the Hogwild! approach, where multiple threads of computation update shared parameter buffers concurrently, without any locking. This allows near-linear scaling with little degradation in model quality as long as gradients are relatively sparse.

There is also a short list of things I don’t want, or don’t care enough about to add for now:

- GPU support. I mostly want to fit tiny models (or at least models with lots of parameters but little computation per minibatch).
- CNNs, or, indeed, tensors with more than two dimensions.

Given the list of requirements (and non-requirements), some design decisions follow naturally.

- The whole thing is going to be written in a compiled language that is capable of producing native shared objects with no runtime. Models will also be defined in the same language.
- That language is going to be [[https://www.rust-lang.org/][Rust]]. It’s an amazing language, and a perfect fit for this sort of task. For this reason, a lot of what follows has a Rust flavour. However, the design trade-offs I describe will (I believe) be the same in C++ and other statically typed and AOT compiled programming languages.
- I’m going to use [[https://rufflewind.com/2016-12-30/reverse-mode-automatic-differentiation][reverse-mode autodifferentiation]]. That way, I can easily backpropagate through arbitrary (static) computation graphs with multiple inputs.

When writing libraries, I often think of the API I want to be able to expose and work back from there. In this case, I want to write something like the following:
#+BEGIN_SRC rust
   let slope = Parameter::new(1.0);
   let intercept = Parameter::new(0.0);
   let x = Input::new(3.0);
   let y = Input::new(2.0 * 3.0 + 1.0);
   let loss = (y — (slope * x + intercept)).square();
   loss.backward();
#+END_SRC

and have it just work.

Preliminaries done, we can move on to the fun part: figuring out how to implement the graph.
