content.org
*** Representing the graph
What sort of data structure do we choose to represent the graph? I looked at two alternatives.

- Vector-based: all the computation nodes are stored contiguously in a vector, and use indices into that vector to address their parent nodes. For example, when creating an input node, an InputNode object is pushed onto the vector with index 0. If you then square that node, SquareNode is pushed onto the tape with index 1, knowing that its parent is an index 0. During a forward pass, the square node will use that index to get the value of its input.
- Graph-based. Nodes are placed at arbitrary locations in memory, and use references to their parents to maintain the graph structure. (The vector representation can be seen as a linearization of the graph-based model.)

#+BEGIN_SRC 
       Vector-based                              Graph-based

     +---------------+                       +-----------------+   
     |               |                       |                 |   
  +-->     A * B     <--+                +--->      A * B      <--+
  |  |               |  |                |   |                 |  |
  |  +---------------+  |                |   +-----------------+  |
  |  |               |  |                |                        |
  |  |       B       +--+                |                        |
  |  |               |                   |                        |
  |  +---------------+            +------+---------+    +---------+-------+
  |  |               |            |                |    |                 |
  +--+       A       |            |       A        |    |        B        |
     |               |            |                |    |                 |
     +---------------+            +----------------+    +-----------------+
#+END_SRC

There are a couple of advantages to the vector-based approach.
- All the nodes are in the same place. They are stored contiguously in memory, potentially reducing memory locality problems.
- It’s easy to reason about their ownership. This makes cloning the graph very easy: you just clone the node vector. This is important because I rely on having multiple copies of the graph for my parallelization approach.
- The nodes are arranged in topological order. We can correctly perform a forward pass with no duplicate work by simply iterating forward along the vector.

But there are also disadvantages.

It’s not clear what sort of object we are storing in the node vector. All of the nodes are different types (of different sizes), and vectors are homogeneously typed. Rust offers two solutions to this problem, but neither is fully satisfactory.

The first is [[https://doc.rust-lang.org/book/first-edition/enums.html][enums]] (sum types; ADTs; tagged unions). We define a ~Node~ type to be the union of all possible node types, and store that in the node vector. This way, everything has the same type. We still need to dispatch the node’s methods from the enclosing ~Node~ type to the contained inner node. This can be done via [[https://doc.rust-lang.org/book/first-edition/match.html][pattern matching]] (a switch statement on the tags of the union type); with Rust’s support for pattern matching and macros, writing the necessary code is a breeze.

However, this imposes a runtime cost. Every time we use a node, we need to go through the switch statement to resolve the inner type. In principle, optimizing compilers will compile such code to jump tables. In practice, the assembly generated for the dispatch code in my experiments was simply a linear scan over all the possibilities, imposing a dispatch cost that is linear in the number of concrete node types the framework supports. Worse still, the compiler is reluctant to inline both the switch itself and the called functions. The former is bad because it increases branch prediction misses, the latter increases function call overhead. (This problem is exacerbated by the recent branch-prediction attacks: it’s likely that [[http://archive.is/s831k][compiler mitigations]] will make indirect instructions like these substantially more expensive.)

The final disadvantage of using sum types for the node vector is that it results in a closed system (akin to Scala’s [[https://underscore.io/blog/posts/2015/06/02/everything-about-sealed.html][sealed traits]]): downstream users of the library cannot add new node types.

The alternative is to use Rust’s runtime polymorphism mechanism, [[https://doc.rust-lang.org/book/first-edition/trait-objects.html][trait objects]]. Trait objects are a way of abstracting over the concrete type of an object: instead of storing structs inline, we hide them behind a pointer to their data and a table of their methods. When calling a method, we jump to the vtable, find the function, and execute it. Using trait objects, we put these fat pointers into the node vector instead of nodes themselves.

This solution, however, introduces exactly the kind of indirection we set out to avoid in the first place. Additionally, it completely defeats the compiler’s efforts at inlinining: the function to be called is not known until runtime.

What about the graph-based design? Here, each node is placed in its own location in memory, and can refer to its ancestors via references. Because each node can be re-used an arbitrary number of times, I use Rust’s equivalent of a ~shared_ptr~ from C++, [[https://doc.rust-lang.org/std/rc/struct.Rc.html][~the Rc<T>~]].

One immediate disadvantage of this approach is that it blurs the ownership structure of the graph, making cloning and serialization/deserialization difficult: because nodes can be re-used, naive cloning/deserialization will result in multiple copies of the same nodes being created.

The second disadvantage is the lack of a readily-available topological ordering: both forward and backward passes have to be done recursively, and care has to be taken to avoid re-computing the values of shared subgraphs.

The advantage of using the graph representation is the types of any node’s parents are known at compile time. Every node is (recursively) generic over the types of its parents: adding two InputNodes will produce an ~AddNode<InputNode, InputNode>~. Adding that to another input node will produce an ~AddNode<AddNode<InputNode, InputNode>, InputNode>~ and so on. This gives me static method dispatch and the potential for inlining, in addition to a design that plays much more nicely with the type system.

